// TODO Exercise 1----------------------------------------------------------------

// Оголоси дві змінні, productName для назви товару, і pricePerItem для зберігання ціни за штуку. При оголошенні надай змінним наступні значення:
// назва - рядок "Droid";
// ціна за штуку - число 2000.

// const productName = "Droid";
// const pricePerItem = 2000;
// console.log(pricePerItem);
// console.log(productName);

// TODO Exercise 2----------------------------------------------------------------

// Ім'я товару змінили на "Repair droid" і збільшили його ціну на 1500 кредитів. Перевизнач значення змінних pricePerItem і productName після їх оголошення.

// let productName = "Droid";
// let pricePerItem = 2000;
// productName = "Repair droid";
// pricePerItem = 3500;

// TODO Exercise 3----------------------------------------------------------------

// Оголоси наступні змінні, використовуючи ключове слово const або let, і присвой їм відповідні значення.

// const topSpeed = 160;
// const distance = 617.54;
// const login = "mango935";
// const isOnline = true;
// const isAdmin = false;

// TODO Exercise 4----------------------------------------------------------------

// Доповни код, присвоївши змінній totalPrice вираз для підрахунку загальної суми замовлення. Змінна pricePerItem зберігає ціну однієї одиниці товару, а orderedQuantity - кількість одиниць товару в замовленні.

// const pricePerItem = 3500;
// const orderedQuantity = 4;
// const totalPrice = pricePerItem * orderedQuantity;

// TODO Exercise 5----------------------------------------------------------------

// Оголоси змінну message і запиши в неї повідомлення про покупку, рядок у форматі: "You picked <назва товару>, price per item is <ціна товару> credits". Де <назва товару> і <ціна товару> — це значення змінних productName і pricePerItem. Використовуй синтаксис шаблонних рядків.

// const productName = "Droid";
// const pricePerItem = 3500;
// const message = `You picked ${productName}, price per item is ${pricePerItem} credits`;

// TODO Exercise 6----------------------------------------------------------------

// Магазин з продажу ремонтних дроїдів готовий до відкриття, залишилося написати скрипт для їх замовлення. Оголоси змінні та присвой їм відповідні значення:
// pricePerDroid - ціна одного дроїда, значення 800
// orderedQuantity - кількість дроїдів у замовленні, значення 6
// deliveryFee - вартість доставки, значення 50
// totalPrice - загальна сума замовлення до сплати, не забудь про вартість доставки
// message - повідомлення про стан замовлення у форматі "You ordered droids worth <total price> credits. Delivery (<delivery fee> credits) is included in total price."

// TODO Exercise 7----------------------------------------------------------------

// Оголоси функцію sayHi, всередині якої додай console.log() з рядком "Hello, this is my first function!".Після оголошення виклич функцію sayHi.

// function sayHi() {
//   console.log("Hello, this is my first function!");
// }
// sayHi();

// TODO Exercise 8----------------------------------------------------------------

// Функція add повинна вміти додавати три числа і виводити результат у консоль. Додай функції add три параметри: a, b і c, які будуть отримувати значення аргументів під час її виклику.
// Доповни console.log() таким чином, щоб він логував рядок "Addition result equals <result>", де < result > - це сума переданих чисел.

// function add(a, b, c) {
//   console.log(`Addition result equals ${a + b + c}`);
// }

// add(15, 27, 10);
// add(10, 20, 30);
// add(5, 10, 15);

// TODO Exercise 9----------------------------------------------------------------

// Доповни код функції add таким чином, щоб вона повертала результат додавання значень трьох параметрів: a, b і c.

function add(a, b, c) {
  return a + b + c;
}

add(2, 5, 8);
add(15, 27, 10);
add(10, 20, 30);
add(5, 10, 15);

// TODO Exercise 10----------------------------------------------------------------

// Функція makeMessage(name, price) складає і повертає повідомлення про покупку. Вона оголошує два параметри, значення яких будуть задаватися під час її виклику.
// name - назва товару
// price - ціна товару
// Доповни код функції таким чином, щоб у змінну message записувався рядок "You picked <product name>, price per item is <product price> credits", де < product name > і < product price > - це значення параметрів name і price.Використовуй синтаксис шаблонних рядків.

function makeMessage(name, price) {
  const message = `You picked ${name}, price per item is ${price} credits`;
  return message;
}
makeMessage("Radar", 6150);
console.log(makeMessage("Scanner", 3500));
console.log(makeMessage("Reactor", 8000));
console.log(makeMessage("Engine", 4070));

// TODO Exercise 11----------------------------------------------------------------

// Функція calculateTotalPrice рахує і повертає загальну суму покупки. Вона приймає два параметри, значення яких будуть задаватися під час її виклику.
// orderedQuantity - кількість одиниць товару в замовленні;
// pricePerItem - ціна однієї одиниці товару.
// Доповни код функції таким чином, щоб у змінну totalPrice записувалася загальна сума покупки - результат множення кількості товарів на ціну одного.

// function calculateTotalPrice (orderedQuantity, pricePerItem) {
//   const totalPrice = orderedQuantity * pricePerItem;
//   return totalPrice;
// };
// console.log(calculateTotalPrice(5, 100));
// console.log(calculateTotalPrice(8, 60));
// console.log(calculateTotalPrice(3, 400));
// console.log(calculateTotalPrice(1, 3500));
// console.log(calculateTotalPrice(12, 70));

// TODO Exercise 12----------------------------------------------------------------

// TODO Exercise 13----------------------------------------------------------------

// TODO Exercise 14----------------------------------------------------------------
// TODO Exercise 15----------------------------------------------------------------
// TODO Exercise 16----------------------------------------------------------------
// TODO Exercise 17----------------------------------------------------------------
// TODO Exercise 18----------------------------------------------------------------
// TODO Exercise 19----------------------------------------------------------------
// TODO Exercise 20----------------------------------------------------------------
// TODO Exercise 21----------------------------------------------------------------
// TODO Exercise 22----------------------------------------------------------------
// TODO Exercise 23----------------------------------------------------------------
// TODO Exercise 24----------------------------------------------------------------
// TODO Exercise 25----------------------------------------------------------------
// TODO Exercise 26----------------------------------------------------------------
// TODO Exercise 27----------------------------------------------------------------
// TODO Exercise 28----------------------------------------------------------------
// TODO Exercise 29----------------------------------------------------------------
// TODO Exercise 30----------------------------------------------------------------
// TODO Exercise 31----------------------------------------------------------------
// TODO Exercise 32----------------------------------------------------------------
// TODO Exercise 33----------------------------------------------------------------
// TODO Exercise 34----------------------------------------------------------------
// TODO Exercise 35----------------------------------------------------------------
// TODO Exercise 36----------------------------------------------------------------
