// Exercise 1----------------------------------------------------------------
// function makePizza() {
//   return "Your pizza is being prepared, please wait.";
// }
// // Change code below this line

// const result = makePizza();
// const pointer = makePizza;

// Exercise 2----------------------------------------------------------------
// Доповни функцію makeMessage таким чином, щоб вона очікувала другим
// параметром(параметр callback) колбек - функцію і повертала її виклик.
// Функція deliverPizza або makePizza буде передаватися як колбек і очікувати
// аргументом ім'я готової піци, що доставляється.

function deliverPizza(pizzaName) {
  return `Delivering ${pizzaName} pizza.`;
}

function makePizza(pizzaName) {
  return `Pizza ${pizzaName} is being prepared, please wait...`;
}

// Chande code below this line
function makeMessage(pizzaName, callback) {
  return callback(pizzaName);
}
console.log(makeMessage("Royal Grand", makePizza));
console.log(makeMessage("Ultracheese", deliverPizza));

// Exercise 3----------------------------------------------------------------
function makePizza(pizzaName, callback) {
  console.log(`Pizza ${pizzaName} is being prepared, please wait...`);
  callback(pizzaName);
}

makePizza("Royal Grand", function deliverPizza(pizzaName) {
  console.log(`Delivering pizza ${pizzaName}.`);
});
// Change code below this line

makePizza("Ultracheese", function eatPizza(pizzaName) {
  console.log(`Eating pizza ${pizzaName}.`);
});

// Exercise 4----------------------------------------------------------------

// Exercise 5----------------------------------------------------------------

// Exercise 6----------------------------------------------------------------

// Exercise 7----------------------------------------------------------------

// Exercise 8----------------------------------------------------------------

// Exercise 9----------------------------------------------------------------

// Exercise 10----------------------------------------------------------------

// Exercise 11----------------------------------------------------------------
// Exercise 12----------------------------------------------------------------
// Exercise 13----------------------------------------------------------------
// Exercise 14----------------------------------------------------------------
// Exercise 15----------------------------------------------------------------
// Exercise 16----------------------------------------------------------------
// Exercise 17----------------------------------------------------------------
// Exercise 18----------------------------------------------------------------
// Exercise 19----------------------------------------------------------------
// Exercise 20----------------------------------------------------------------
// Exercise 21----------------------------------------------------------------
// Exercise 22----------------------------------------------------------------
// Exercise 23----------------------------------------------------------------
// Exercise 24----------------------------------------------------------------
// Exercise 25----------------------------------------------------------------
// Exercise 26----------------------------------------------------------------
// Exercise 27----------------------------------------------------------------
// Exercise 28----------------------------------------------------------------
// Exercise 29----------------------------------------------------------------
// Exercise 30----------------------------------------------------------------
// Exercise 31----------------------------------------------------------------
// Exercise 32----------------------------------------------------------------
// Exercise 33----------------------------------------------------------------
// Exercise 34----------------------------------------------------------------
// Exercise 35----------------------------------------------------------------
// Exercise 36----------------------------------------------------------------
